export default async function HomePage() {
  return (
    <section className='flex flex-col gap-6'>
      <h1 className='text-2xl font-semibold'>신승준</h1>
      <p className='prose dark:prose-invert'>
        코드를 작성하는 행위 자체를 좋아합니다. 그리고 작은 것들을 조합해서 꽤나 크면서 복잡한 구조가 잘 동작할 때
        짜릿함을 느껴요. 사용자 수는 적더라도 제 주변의 사람들을 도울 수 있는 프로그램을 만들어보고 싶습니다.
        <br />
        <br />
        일을 할 땐 동료들과 유쾌하게 웃으며 잡담하고, 업무는 몰입해서 하는 순간들 속에서 행복을 느낍니다. :)
        <br />
        <br />
        제 경력은 반도체 설비 엔지니어로 시작했어요. 그러다가 &apos;더 늦기 전에 하고 싶은 걸 해보자&apos;라는 생각으로
        뛰쳐나와 지금은 웹 프론트엔드 개발자로 일하고 있습니다.
        <br />
        <br />
        경제, 특히 주식에 대해 관련된 책들을 읽으며 공부하고 있습니다. 소신파 장기투자자가 되길 꿈꿉니다.
        <br />
        <br />
        주말 오전에는 등산을 즐겨 해요. 평일동안 어떻게 살았는지 자연스럽게 회고해볼 수 있고, 다음 주에는 어떻게
        살아볼지 단기적인 계획과 목표를 생각할 수 있더라구요. 오후에는 카페에서 책 읽는 걸 즐겨요. 적당한 주변 소리,
        충분한 시간과 함께 정말 재밌는 책을 만나길 항상 기대합니다.
        <br />
        <br />
      </p>
    </section>
  );
}
