export default async function HomePage() {
  return (
    <section className='flex flex-col gap-6'>
      <h1 className='text-2xl font-semibold'>신승준</h1>
      <p className='prose dark:prose-invert'>
        코드를 작성하는 행위 자체를 좋아합니다. 그리고 작은 것들을 조합해서 꽤나 크면서 복잡한 구조가 잘 동작할 때
        짜릿하곤 합니다. 그리고 요즘엔 동료들과 유쾌하게 웃으며 잡담하고, 일은 또 몰입해서 하는 순간들 속에서 행복을
        느낍니다. :)
        <br />
        <br />
        제 경력은 반도체 설비 엔지니어로 시작했었습니다. 그러다가 &apos;더 늦기 전에 하고 싶은 걸 해보자&apos;라는
        생각으로 뛰쳐나와 지금은 프론트엔드 개발자로 일하고 있습니다.
        <br />
        <br />
        경제, 특히 주식에 대해 관련된 책들을 읽으며 공부하고 있습니다. 소신파 장기투자자가 되길 꿈꿉니다.
        <br />
        <br />
        주말 오후에는 스타벅스에 가서 4시간 이상 앉아 있곤 합니다. 오전엔 많은 생각을 하기 위해 종종 등산도 합니다. 가끔
        별다른 걱정 없이 책만 읽을 수 있는 시간이 생기면 설레기도 합니다.
        <br />
        <br />
        현재 개발자로서는 기술적으로 단단해지고 싶습니다. 그러기 위해서 나름의 시스템을 구축해보고 있습니다.
        <br />
        <br />
      </p>
    </section>
  );
}
