export default async function HomePage() {
  return (
    <section className='flex flex-col gap-6'>
      <h1 className='sr-only'>신승준</h1>
      <p className='prose dark:prose-invert'>
        늙어서도 유쾌하게 제품을 만들고 싶은 개발자 신승준입니다. 현재 팀스파르타라는 회사에서 좋은 동료들에게 둘러싸여 정말
        재밌게 일하고 있어요.
        <br />
        <br />
        동료들을 위해, 세상 사람들을 위해 보상을 기대하지 않고 &apos;선물&apos;할 수 있는 것은 무엇일까를 생각하며 살고 있습니다. 이러한 가치관이 제 삶을 더 풍족하게 만든다고 믿어요.
        <br />
        <br />
        해외주식 자동매매봇을 만들어볼만큼 투자에 대해 관심이 많아요. 투자를 알아가다보면 세상이 어떻게
        돌아가는지를 알 수 있더라구요. 투자에서 욕심은 젊을 때 부릴 수 있는 특권이라는 생각에 조금 욕심을 부려서
        레버리지 ETF에 투자하고 있습니다.
        <br />
        <br />
        주말 오전에 등산을 즐겨 해요. 평일동안 어떻게 살았는지 자연스럽게 되새겨 볼 수 있고, 다음 주에는 어떻게 살아볼지
        단기적인 계획들이 잘 떠오르더라구요.
        <br />
        <br />
        카페에서 책 읽는 것도 좋아해요. 적당한 소음과 여유로움, 정말 재밌는 책. 이 3가지가 어우러진 시간이 절
        충전시켜주고 있습니다.
      </p>
    </section>
  );
}
